app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.collect {|post| [post.postable, post.id] }.reverse.page(
      params[:page].to_i || 0)

SELECT "users".* FROM "users" WHERE "users"."display_name" = 'jan' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = 3 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."feed_id" = 3
---
  def show
    user = User.find_by_display_name(params[:id])
    temp_posts = user.feed.posts.reverse.page(params[:page].to_i || 0)

SELECT "users".* FROM "users" WHERE "users"."subdomain" = '' LIMIT 1
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."feed_id" = 1
---
  def ind
    user = User.find_by_subdomain(request.subdomain)
    if (current_user && user && current_user == user) || (user.nil? &&  current_user)
      user = current_user
    end
    params[:page] = "0" if params[:page] && params[:page] == "NaN"
    temp_posts = user.feed.posts.reverse.page(params[:page].to_i || 0)